"""
Задача -9: Очистка адресов
Привести адреса к стандартному формату
"""
import re

addresses = [
 " г. Москва, ул. Ленина, д. 10 ",
 "г.Казань,ул.Баумана,д.15",
 " г. Санкт-Петербург, ул. Невский, д. 100 "
]

print("=== СРАВНЕНИЕ ===")

for i, address in enumerate(addresses, 1):
    old_address = address

    """Убираем пробелы по краям"""
    address_01 = address.strip()

    """Добавляем пробелы после сокращений: г., ул., д., если они написаны слитно со следующим словом"""
    address_02 = re.sub(r'(г\.|ул\.|д\.)(\S)', r'\1 \2', address_01)

    """Унифицируем запятые'"""
    address_03 = re.sub(r'\s*,\s*', ', ', address_02)

    print(f"#{i}")
    print(f"ДО: '{old_address}'")
    print(f"ПОСЛЕ: '{address_03}'")