"""
Задача 8: Анализ заказов
Использование множеств для анализа материалов трех подрядчика
"""

list_1 = ["кирпич", "цемент", "песок", "гравий", "металл", "древесина"]
list_2 = ["цемент", "песок", "керамзитоблок", "гипс", "древесина", "кирпич"]
list_3 = ["кирпич", "цемент", "гравий", "гипс", "стекло", "камень"]

"""Преобразуем списки во множества"""
set_1 = set(list_1)
set_2 = set(list_2)
set_3 = set(list_3)

"""Найдем все уникальные элементы в списках"""
only_set_1 = set_1 - set_2 - set_3
only_set_2 = set_2 - set_1 - set_3
only_set_3 = set_3 - set_2 - set_1
print(only_set_1 | only_set_2 | only_set_3)
